<a href="https://colab.research.google.com/github/brunonbn/intro-data-science/blob/main/ExerciciosSelecao.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exercícios relacionados com seleção de dados em um DataFrame

## Curso Python Pandas: Tratando e analisando dados
### Capítulo 5 - Frequências de imóveis

In [1]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [5]:
# apenas alunos aprovados
selecao = alunos['Aprovado'] == True
n1 = alunos[selecao]
n1

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [6]:
# apenas alunos aprovados do sexo feminino
selecao = (alunos['Aprovado'] == True) & (alunos['Sexo'] == 'F')
n2 = alunos[selecao]
n2

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [7]:
# idade entre 10 e 20 anos ou com idade maior ou igual a 40 anos
selecao = (alunos.Idade >= 10) & (alunos.Idade <= 20) | (alunos.Idade >= 40)
n3 = alunos[selecao]
n3

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False